Revit 2027 API
BuiltInFailures.CutFailures.DormerCutProblem Property
 Dormer Opening Cut is not fully defined. Cut was not performed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DormerCutProblem { get; }
Public Shared ReadOnly Property DormerCutProblem As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DormerCutProblem {
	FailureDefinitionId^ get ();
}
static member DormerCutProblem : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CutFailures Class
Autodesk.Revit.DB Namespace